data/raw_bench/500_output.txt
Running 30s test @ http://10.99.59.146:8080/wrk2-api/home-timeline/read
  4 threads and 200 connections

  Thread calibration: mean lat.: 0.591ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.589ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.587ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.593ms, rate sampling interval: 10ms

-----------------------------------------------------------------------
Test Results @ http://10.99.59.146:8080/wrk2-api/home-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   592.66us  102.56us   0.86ms   70.93%
    Req/Sec   132.46    117.67   444.00     57.71%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  586.00us
 75.000%  655.00us
 90.000%  720.00us
 99.000%    0.86ms
 99.900%    1.23ms
 99.990%    1.35ms
 99.999%    1.66ms
100.000%    1.66ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.338     0.000000            1         1.00
       0.470     0.100000         1019         1.11
       0.504     0.200000         2015         1.25
       0.531     0.300000         2998         1.43
       0.559     0.400000         3996         1.67
       0.586     0.500000         4990         2.00
       0.599     0.550000         5481         2.22
       0.612     0.600000         5974         2.50
       0.626     0.650000         6474         2.86
       0.640     0.700000         6981         3.33
       0.655     0.750000         7482         4.00
       0.663     0.775000         7723         4.44
       0.672     0.800000         7985         5.00
       0.681     0.825000         8220         5.71
       0.692     0.850000         8478         6.67
       0.705     0.875000         8727         8.00
       0.712     0.887500         8848         8.89
       0.720     0.900000         8962        10.00
       0.729     0.912500         9095        11.43
       0.738     0.925000         9215        13.33
       0.750     0.937500         9334        16.00
       0.757     0.943750         9405        17.78
       0.764     0.950000         9459        20.00
       0.772     0.956250         9523        22.86
       0.781     0.962500         9580        26.67
       0.795     0.968750         9646        32.00
       0.801     0.971875         9680        35.56
       0.807     0.975000         9706        40.00
       0.814     0.978125         9737        45.71
       0.825     0.981250         9771        53.33
       0.834     0.984375         9800        64.00
       0.839     0.985938         9815        71.11
       0.846     0.987500         9829        80.00
       0.855     0.989062         9845        91.43
       0.867     0.990625         9861       106.67
       0.878     0.992188         9876       128.00
       0.884     0.992969         9886       142.22
       0.893     0.993750         9891       160.00
       0.900     0.994531         9899       182.86
       0.921     0.995313         9907       213.33
       0.937     0.996094         9915       256.00
       0.949     0.996484         9919       284.44
       0.956     0.996875         9922       320.00
       0.994     0.997266         9926       365.71
       1.043     0.997656         9930       426.67
       1.145     0.998047         9934       512.00
       1.175     0.998242         9936       568.89
       1.197     0.998437         9938       640.00
       1.201     0.998633         9940       731.43
       1.217     0.998828         9942       853.33
       1.238     0.999023         9944      1024.00
       1.263     0.999121         9945      1137.78
       1.275     0.999219         9946      1280.00
       1.282     0.999316         9947      1462.86
       1.288     0.999414         9948      1706.67
       1.305     0.999512         9949      2048.00
       1.305     0.999561         9949      2275.56
       1.321     0.999609         9950      2560.00
       1.321     0.999658         9950      2925.71
       1.346     0.999707         9951      3413.33
       1.346     0.999756         9951      4096.00
       1.346     0.999780         9951      4551.11
       1.347     0.999805         9952      5120.00
       1.347     0.999829         9952      5851.43
       1.347     0.999854         9952      6826.67
       1.347     0.999878         9952      8192.00
       1.347     0.999890         9952      9102.22
       1.659     0.999902         9953     10240.00
       1.659     1.000000         9953          inf
#[Mean    =        0.593, StdDeviation   =        0.103]
#[Max     =        1.659, Total count    =         9953]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  14937 requests in 30.01s, 2.83MB read
  Socket errors: connect 0, read 0, write 0, timeout 223
Requests/sec:    497.71  
Transfer/sec:     96.72KB