data/raw_bench/600_output.txt
Running 30s test @ http://10.99.59.146:8080/wrk2-api/home-timeline/read
  4 threads and 200 connections

  Thread calibration: mean lat.: 0.587ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.591ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.588ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.607ms, rate sampling interval: 10ms

-----------------------------------------------------------------------
Test Results @ http://10.99.59.146:8080/wrk2-api/home-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   588.82us  104.58us   0.85ms   70.69%
    Req/Sec   157.39    126.10   500.00     59.42%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  579.00us
 75.000%  651.00us
 90.000%  722.00us
 99.000%    0.85ms
 99.900%    1.21ms
 99.990%    1.75ms
 99.999%    1.93ms
100.000%    1.93ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.309     0.000000            1         1.00
       0.467     0.100000         1200         1.11
       0.500     0.200000         2417         1.25
       0.526     0.300000         3599         1.43
       0.553     0.400000         4776         1.67
       0.579     0.500000         5934         2.00
       0.593     0.550000         6532         2.22
       0.608     0.600000         7150         2.50
       0.622     0.650000         7742         2.86
       0.635     0.700000         8304         3.33
       0.651     0.750000         8916         4.00
       0.659     0.775000         9193         4.44
       0.669     0.800000         9494         5.00
       0.680     0.825000         9803         5.71
       0.692     0.850000        10103         6.67
       0.706     0.875000        10379         8.00
       0.714     0.887500        10545         8.89
       0.722     0.900000        10683        10.00
       0.731     0.912500        10831        11.43
       0.740     0.925000        10982        13.33
       0.751     0.937500        11123        16.00
       0.757     0.943750        11204        17.78
       0.764     0.950000        11273        20.00
       0.770     0.956250        11343        22.86
       0.779     0.962500        11421        26.67
       0.789     0.968750        11491        32.00
       0.796     0.971875        11530        35.56
       0.802     0.975000        11567        40.00
       0.810     0.978125        11605        45.71
       0.819     0.981250        11640        53.33
       0.830     0.984375        11678        64.00
       0.837     0.985938        11695        71.11
       0.842     0.987500        11714        80.00
       0.848     0.989062        11733        91.43
       0.853     0.990625        11750       106.67
       0.872     0.992188        11771       128.00
       0.877     0.992969        11778       142.22
       0.886     0.993750        11787       160.00
       0.909     0.994531        11797       182.86
       0.931     0.995313        11806       213.33
       0.955     0.996094        11815       256.00
       0.969     0.996484        11820       284.44
       0.994     0.996875        11824       320.00
       1.012     0.997266        11829       365.71
       1.083     0.997656        11834       426.67
       1.127     0.998047        11838       512.00
       1.153     0.998242        11841       568.89
       1.161     0.998437        11843       640.00
       1.196     0.998633        11845       731.43
       1.210     0.998828        11849       853.33
       1.238     0.999023        11850      1024.00
       1.267     0.999121        11851      1137.78
       1.273     0.999219        11852      1280.00
       1.284     0.999316        11853      1462.86
       1.372     0.999414        11855      1706.67
       1.396     0.999512        11856      2048.00
       1.396     0.999561        11856      2275.56
       1.406     0.999609        11857      2560.00
       1.406     0.999658        11857      2925.71
       1.443     0.999707        11858      3413.33
       1.450     0.999756        11859      4096.00
       1.450     0.999780        11859      4551.11
       1.450     0.999805        11859      5120.00
       1.450     0.999829        11859      5851.43
       1.747     0.999854        11860      6826.67
       1.747     0.999878        11860      8192.00
       1.747     0.999890        11860      9102.22
       1.747     0.999902        11860     10240.00
       1.747     0.999915        11860     11702.86
       1.932     0.999927        11861     13653.33
       1.932     1.000000        11861          inf
#[Mean    =        0.589, StdDeviation   =        0.105]
#[Max     =        1.932, Total count    =        11861]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  17711 requests in 30.01s, 3.36MB read
  Socket errors: connect 0, read 0, write 0, timeout 142
Requests/sec:    590.22  
Transfer/sec:    114.70KB