data/raw_bench/700_output.txt
Running 30s test @ http://10.99.59.146:8080/wrk2-api/home-timeline/read
  4 threads and 200 connections

  Thread calibration: mean lat.: 0.609ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.583ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.588ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.582ms, rate sampling interval: 10ms

-----------------------------------------------------------------------
Test Results @ http://10.99.59.146:8080/wrk2-api/home-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   586.43us  104.73us   0.85ms   71.16%
    Req/Sec   182.20    136.79   555.00     67.77%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  578.00us
 75.000%  650.00us
 90.000%  718.00us
 99.000%    0.85ms
 99.900%    1.30ms
 99.990%    1.60ms
 99.999%    1.71ms
100.000%    1.71ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.322     0.000000            2         1.00
       0.464     0.100000         1406         1.11
       0.496     0.200000         2771         1.25
       0.524     0.300000         4145         1.43
       0.553     0.400000         5548         1.67
       0.578     0.500000         6909         2.00
       0.591     0.550000         7599         2.22
       0.605     0.600000         8262         2.50
       0.619     0.650000         8980         2.86
       0.634     0.700000         9668         3.33
       0.650     0.750000        10334         4.00
       0.659     0.775000        10697         4.44
       0.667     0.800000        11017         5.00
       0.677     0.825000        11361         5.71
       0.689     0.850000        11714         6.67
       0.702     0.875000        12053         8.00
       0.709     0.887500        12214         8.89
       0.718     0.900000        12395        10.00
       0.726     0.912500        12560        11.43
       0.736     0.925000        12747        13.33
       0.747     0.937500        12903        16.00
       0.754     0.943750        12998        17.78
       0.760     0.950000        13083        20.00
       0.767     0.956250        13161        22.86
       0.775     0.962500        13248        26.67
       0.785     0.968750        13332        32.00
       0.792     0.971875        13374        35.56
       0.798     0.975000        13419        40.00
       0.806     0.978125        13462        45.71
       0.815     0.981250        13504        53.33
       0.826     0.984375        13546        64.00
       0.833     0.985938        13571        71.11
       0.838     0.987500        13590        80.00
       0.845     0.989062        13610        91.43
       0.855     0.990625        13631       106.67
       0.869     0.992188        13655       128.00
       0.882     0.992969        13664       142.22
       0.891     0.993750        13674       160.00
       0.908     0.994531        13686       182.86
       0.928     0.995313        13696       213.33
       0.965     0.996094        13707       256.00
       0.977     0.996484        13712       284.44
       1.018     0.996875        13717       320.00
       1.051     0.997266        13723       365.71
       1.072     0.997656        13728       426.67
       1.144     0.998047        13734       512.00
       1.171     0.998242        13736       568.89
       1.193     0.998437        13739       640.00
       1.217     0.998633        13742       731.43
       1.259     0.998828        13744       853.33
       1.304     0.999023        13747      1024.00
       1.305     0.999121        13748      1137.78
       1.333     0.999219        13750      1280.00
       1.336     0.999316        13751      1462.86
       1.345     0.999414        13752      1706.67
       1.370     0.999512        13754      2048.00
       1.370     0.999561        13754      2275.56
       1.379     0.999609        13755      2560.00
       1.411     0.999658        13756      2925.71
       1.411     0.999707        13756      3413.33
       1.496     0.999756        13757      4096.00
       1.496     0.999780        13757      4551.11
       1.544     0.999805        13758      5120.00
       1.544     0.999829        13758      5851.43
       1.544     0.999854        13758      6826.67
       1.598     0.999878        13759      8192.00
       1.598     0.999890        13759      9102.22
       1.598     0.999902        13759     10240.00
       1.598     0.999915        13759     11702.86
       1.598     0.999927        13759     13653.33
       1.714     0.999939        13760     16384.00
       1.714     1.000000        13760          inf
#[Mean    =        0.586, StdDeviation   =        0.105]
#[Max     =        1.714, Total count    =        13760]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  20561 requests in 30.01s, 3.90MB read
  Socket errors: connect 0, read 0, write 0, timeout 83
Requests/sec:    685.25  
Transfer/sec:    133.17KB